In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Omar', 'Mostafa', 'Ahmed', 'Alaa'],
    'Age': [25, 19, 22, 35]
}

df = pd.DataFrame(data, index=[3, 1, 4, 2])
df

      Name  Age
3     Omar   25
1  Mostafa   19
4    Ahmed   22
2     Alaa   35

In [3]:
# Sort by index
sorted_df = df.sort_index()
sorted_df

      Name  Age
1  Mostafa   19
2     Alaa   35
3     Omar   25
4    Ahmed   22

In [4]:
df = df.sort_values(by='Name', ascending=True)
df

      Name  Age
4    Ahmed   22
2     Alaa   35
1  Mostafa   19
3     Omar   25

In [5]:
df = df.sort_values(by='Age', ascending=True)
df

      Name  Age
1  Mostafa   19
4    Ahmed   22
3     Omar   25
2     Alaa   35